package javaFund;
// 이건 라인주석. 컴파일 시 모두 무시됨

/*
 * 이건 블락 주석. 내부의모든 것을무시
 * 
 * 클래스 이름 규칙 : 반드시 첫자는 대문자, 한 단어 이상인 경우 두 번째 단어의 첫자도 대문자, 숫자나 특수문자($, _ 제외)는 클래스 이름의 첫자로 올 수 없음
 * 한글 가능하나 아무도 사용하지 않음
 * 
 * 하나의 자바 파일에는 하나이상의 클래스 정의 가능
 * 이미 저장된 파일명의 클래스가 대표 클래스가 되고, 이 클래스만 public 키워드를 가질 수 있음
 * 또한 이 클래스가 main()을 가지게 됨
 */
class Dosome{
	
}

class Any{
	
}

public class Convention {

	public static void main(String[] args) {
		/*
		 * 자바의 모든 구문(변수선언, 초기화, 대입 등의 구문에는반드시 ;를사용해서 끝을 나타내야 함)
		 */
		int a;

	}

}
